<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Before-your-start:" data-toc-modified-id="Before-your-start:-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Before your start:</a></span></li><li><span><a href="#Challenge-1---Working-with-JSON-files" data-toc-modified-id="Challenge-1---Working-with-JSON-files-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Challenge 1 - Working with JSON files</a></span><ul class="toc-item"><li><ul class="toc-item"><li><ul class="toc-item"><li><span><a href="#After-importing-pandas,-let's-find-a-dataset.-In-this-lesson-we-will-be-working-with-a-NASA-dataset." data-toc-modified-id="After-importing-pandas,-let's-find-a-dataset.-In-this-lesson-we-will-be-working-with-a-NASA-dataset.-2.0.0.1"><span class="toc-item-num">2.0.0.1&nbsp;&nbsp;</span>After importing pandas, let's find a dataset. In this lesson we will be working with a NASA dataset.</a></span></li><li><span><a href="#The-value_counts()-function-is-commonly-used-in-pandas-to-find-the-frequency-of-every-value-in-a-column." data-toc-modified-id="The-value_counts()-function-is-commonly-used-in-pandas-to-find-the-frequency-of-every-value-in-a-column.-2.0.0.2"><span class="toc-item-num">2.0.0.2&nbsp;&nbsp;</span>The <code>value_counts()</code> function is commonly used in pandas to find the frequency of every value in a column.</a></span></li></ul></li></ul></li></ul></li><li><span><a href="#Challenge-2---Working-with-CSV-and-Other-Separated-Files" data-toc-modified-id="Challenge-2---Working-with-CSV-and-Other-Separated-Files-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Challenge 2 - Working with CSV and Other Separated Files</a></span></li><li><span><a href="#Challenge-3---Working-with-Excel-Files" data-toc-modified-id="Challenge-3---Working-with-Excel-Files-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>Challenge 3 - Working with Excel Files</a></span></li><li><span><a href="#Bonus-Challenge---Fertility-Dataset" data-toc-modified-id="Bonus-Challenge---Fertility-Dataset-5"><span class="toc-item-num">5&nbsp;&nbsp;</span>Bonus Challenge - Fertility Dataset</a></span></li></ul></div>

# Before your start:
- Read the README.md file
- Comment as much as you can and use the resources in the README.md file
- Happy learning!

# Challenge 1 - Working with JSON files

Import the pandas library

In [1]:
# Your import here:
import pandas as pd

####  After importing pandas, let's find a dataset. In this lesson we will be working with a NASA dataset.

Run the code in the cell below to load the dataset containing information about asteroids that have landed on earth. This piece of code helps us open the URL for the dataset and deocde the data using UTF-8.

In [2]:
# Run this code

from urllib.request import urlopen
import json

response = urlopen("https://data.nasa.gov/resource/y77d-th95.json")
json_data = response.read().decode('utf-8', 'replace')

In the next cell, load the data in `json_data` and load it into a pandas dataframe. Name the dataframe `nasa`.

In [3]:
# json.loads(json_data) Analiza los datos jason

nasa = pd.DataFrame(json.loads(json_data))

Now that we have loaded the data, let's examine it using the `head()` function.

In [4]:
nasa.head()

,name,id,nametype,recclass,mass,fall,year,reclat,reclong,geolocation,:@computed_region_cbhk_fwbd,:@computed_region_nnqa_25f4
0,Aachen,1,Valid,L5,21,Fell,1880-01-01T00:00:00.000,50.775000,6.083330,"{'type': 'Point', 'coordinates': [6.08333, 50....",NaN,NaN
1,Aarhus,2,Valid,H6,720,Fell,1951-01-01T00:00:00.000,56.183330,10.233330,"{'type': 'Point', 'coordinates': [10.23333, 56...",NaN,NaN
2,Abee,6,Valid,EH4,107000,Fell,1952-01-01T00:00:00.000,54.216670,-113.000000,"{'type': 'Point', 'coordinates': [-113, 54.216...",NaN,NaN
3,Acapulco,10,Valid,Acapulcoite,1914,Fell,1976-01-01T00:00:00.000,16.883330,-99.900000,"{'type': 'Point', 'coordinates': [-99.9, 16.88...",NaN,NaN
4,Achiras,370,Valid,L6,780,Fell,1902-01-01T00:00:00.000,-33.166670,-64.950000,"{'type': 'Point', 'coordinates': [-64.95, -33....",NaN,NaN

#### The `value_counts()` function is commonly used in pandas to find the frequency of every value in a column.

In the cell below, use the `value_counts()` function to determine the frequency of all types of asteroid landings by applying the function to the `fall` column.

In [5]:
nasa.fall.value_counts()

Fell     996
Found      4
Name: fall, dtype: int64

Finally, let's save the dataframe as a json file again. Since we downloaded the file from an online source, the goal of saving the dataframe is to have a local copy. Save the dataframe using the `orient=records` argument and name the file `nasa.json`.

In [6]:
nasa.to_json("../nasa.json",orient="records")

# Challenge 2 - Working with CSV and Other Separated Files

csv files are more commonly used as dataframes. In the cell below, load the file from the URL provided using the `read_csv()` function in pandas. Starting version 0.19 of pandas, you can load a csv file into a dataframe directly from a URL without having to load the file first like we did with the JSON URL. The dataset we will be using contains informtaions about NASA shuttles. 

In the cell below, we define the column names and the URL of the data. Following this cell, read the tst file to a variable called `shuttle`. Since the file does not contain the column names, you must add them yourself using the column names declared in `cols` using the `names` argument. Additionally, a tst file is space separated, make sure you pass ` sep=' '` to the function.

In [7]:
# Run this code:

cols = ['time', 'rad_flow', 'fpv_close', 'fpv_open', 'high', 'bypass', 'bpv_close', 'bpv_open', 'class', '']
tst_url = 'https://archive.ics.uci.edu/ml/machine-learning-databases/statlog/shuttle/shuttle.tst'

In [8]:
shuttle = pd.read_csv(tst_url , sep=" ", names=cols)

Let's verify that this worked by looking at the `head()` function.

In [9]:
shuttle.head()

,time,rad_flow,fpv_close,fpv_open,high,bypass,bpv_close,bpv_open,class,
0,55,0,81,0,-6,11,25,88,64,4
1,56,0,96,0,52,-4,40,44,4,4
2,50,-1,89,-7,50,0,39,40,2,1
3,53,9,79,0,42,-2,25,37,12,4
4,55,2,82,0,54,-6,26,28,2,1

To make life easier for us, let's turn this dataframe into a comma separated file by saving it using the `to_csv()` function. Save `shuttle` into the file `shuttle.csv` and ensure the file is comma separated and that we are not saving the index column.

In [10]:
shuttle.to_csv("../shuttle.csv",sep=",",index=False)

# Challenge 3 - Working with Excel Files

We can also use pandas to convert excel spreadsheets to dataframes. Let's use the `read_excel()` function. In this case, `astronauts.xls` is in the same folder that contains this notebook. Read this file into a variable called `astronaut`. 

Note: Make sure to install the `xlrd` library if it is not yet installed.

In [11]:
pip install xlrd

Requirement already satisfied: xlrd in /Users/joaquin/anaconda3/lib/python3.10/site-packages (2.0.1)
Note: you may need to restart the kernel to use updated packages.

In [12]:
astronaut = pd.read_excel("astronauts.xls")

Use the `head()` function to inspect the dataframe.

In [13]:
astronaut.head()

,Name,Year,Group,Status,Birth Date,Birth Place,Gender,Alma Mater,Undergraduate Major,Graduate Major,Military Rank,Military Branch,Space Flights,Space Flight (hr),Space Walks,Space Walks (hr),Missions,Death Date,Death Mission
0,Joseph M. Acaba,2004.0,19.0,Active,1967-05-17,"Inglewood, CA",Male,University of California-Santa Barbara; Univer...,Geology,Geology,NaN,NaN,2,3307,2,13.0,"STS-119 (Discovery), ISS-31/32 (Soyuz)",NaT,NaN
1,Loren W. Acton,NaN,NaN,Retired,1936-03-07,"Lewiston, MT",Male,Montana State University; University of Colorado,Engineering Physics,Solar Physics,NaN,NaN,1,190,0,0.0,STS 51-F (Challenger),NaT,NaN
2,James C. Adamson,1984.0,10.0,Retired,1946-03-03,"Warsaw, NY",Male,US Military Academy; Princeton University,Engineering,Aerospace Engineering,Colonel,US Army (Retired),2,334,0,0.0,"STS-28 (Columbia), STS-43 (Atlantis)",NaT,NaN
3,Thomas D. Akers,1987.0,12.0,Retired,1951-05-20,"St. Louis, MO",Male,University of Missouri-Rolla,Applied Mathematics,Applied Mathematics,Colonel,US Air Force (Retired),4,814,4,29.0,"STS-41 (Discovery), STS-49 (Endeavor), STS-61 ...",NaT,NaN
4,Buzz Aldrin,1963.0,3.0,Retired,1930-01-20,"Montclair, NJ",Male,US Military Academy; MIT,Mechanical Engineering,Astronautics,Colonel,US Air Force (Retired),2,289,2,8.0,"Gemini 12, Apollo 11",NaT,NaN

Use the `value_counts()` function to find the most popular undergraduate major among all astronauts.

In [14]:
astronaut["Undergraduate Major"].value_counts()

Physics                                  35
Aerospace Engineering                    33
Mechanical Engineering                   30
Aeronautical Engineering                 28
Electrical Engineering                   23
                                         ..
Astronomy                                 1
Marine Engineering & Nautical Science     1
Philosophy                                1
Bioscience                                1
Military Science                          1
Name: Undergraduate Major, Length: 83, dtype: int64

Due to all the commas present in the cells of this file, let's save it as a tab separated csv file. In the cell below, save `astronaut` as a tab separated file using the `to_csv` function. Call the file `astronaut.csv` and remember to remove the index column.

In [15]:
astronaut.to_csv('../astronaut.csv', sep='\t', index=False)

# Bonus Challenge - Fertility Dataset

Visit the following [URL](https://archive.ics.uci.edu/ml/datasets/Fertility) and retrieve the dataset as well as the column headers. Determine the correct separator and read the file into a variable called `fertility`. Examine the dataframe using the `head()` function.

Season in which the analysis was performed. 	1) winter, 2) spring, 3) Summer, 4) fall. 	(-1, -0.33, 0.33, 1) 

Age at the time of analysis. 	18-36 	(0, 1) 

Childish diseases (ie , chicken pox, measles, mumps, polio)	1) yes, 2) no. 	(0, 1) 

Accident or serious trauma 	1) yes, 2) no. 	(0, 1) 

Surgical intervention 	1) yes, 2) no. 	(0, 1) 

High fevers in the last year 	1) less than three months ago, 2) more than three months ago, 3) no. 	(-1, 0, 1) 

Frequency of alcohol consumption 	1) several times a day, 2) every day, 3) several times a week, 4) once a week, 5) hardly ever or never 	(0, 1) 

Smoking habit 	1) never, 2) occasional 3) daily. 	(-1, 0, 1) 

Number of hours spent sitting per day 	ene-16	(0, 1) 

Output: Diagnosis	normal (N), altered (O)

In [16]:
import zipfile

zf = zipfile.ZipFile("zip/fertility.zip")

archivo = zf.open("fertility_Diagnosis.txt")

fertility = pd.read_csv(archivo)
fertility.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 99 entries, 0 to 98
Data columns (total 10 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   -0.33   99 non-null     float64
 1   0.69    99 non-null     float64
 2   0       99 non-null     int64
 3   1       99 non-null     int64
 4   1.1     99 non-null     int64
 5   0.1     99 non-null     int64
 6   0.8     99 non-null     float64
 7   0.2     99 non-null     int64
 8   0.88    99 non-null     float64
 9   N       99 non-null     object
dtypes: float64(4), int64(5), object(1)
memory usage: 7.9+ KB

In [17]:
columns_name = ["season","age","child_desea","accident","surg_int","fever_l_year","f_alc_cons","smoke","h_sit","diagnosis"]
fertility.columns = columns_name
fertility.head() # naming the columns

,season,age,child_desea,accident,surg_int,fever_l_year,f_alc_cons,smoke,h_sit,diagnosis
0,-0.33,0.94,1,0,1,0,0.8,1,0.31,O
1,-0.33,0.50,1,0,0,0,1.0,-1,0.50,N
2,-0.33,0.75,0,1,1,0,1.0,-1,0.38,N
3,-0.33,0.67,1,1,0,0,0.8,-1,0.50,O
4,-0.33,0.67,1,0,1,0,0.8,0,0.50,N

In [18]:
fertility.season = fertility.season.replace({-1:"winter", -0.33:"spring",0.33:"summer",1:"fall"})
fertility.head()

,season,age,child_desea,accident,surg_int,fever_l_year,f_alc_cons,smoke,h_sit,diagnosis
0,spring,0.94,1,0,1,0,0.8,1,0.31,O
1,spring,0.50,1,0,0,0,1.0,-1,0.50,N
2,spring,0.75,0,1,1,0,1.0,-1,0.38,N
3,spring,0.67,1,1,0,0,0.8,-1,0.50,O
4,spring,0.67,1,0,1,0,0.8,0,0.50,N

In [19]:
def calculate_age(value):
    max_age = 36
    min_age = 18
    age = min_age + (value * (max_age - min_age))
    return round(age)

# Add a new column "age" to the DataFrame by applying the function to the "data" column
fertility.age = fertility.age.apply(lambda x: calculate_age(x))

fertility.head()

,season,age,child_desea,accident,surg_int,fever_l_year,f_alc_cons,smoke,h_sit,diagnosis
0,spring,35,1,0,1,0,0.8,1,0.31,O
1,spring,27,1,0,0,0,1.0,-1,0.50,N
2,spring,32,0,1,1,0,1.0,-1,0.38,N
3,spring,30,1,1,0,0,0.8,-1,0.50,O
4,spring,30,1,0,1,0,0.8,0,0.50,N

In [20]:
# Se hace la copia por seguridad # Habría que haberlo hecho antes...
fertilidad = fertility.copy()

In [21]:
fertilidad.head()

,season,age,child_desea,accident,surg_int,fever_l_year,f_alc_cons,smoke,h_sit,diagnosis
0,spring,35,1,0,1,0,0.8,1,0.31,O
1,spring,27,1,0,0,0,1.0,-1,0.50,N
2,spring,32,0,1,1,0,1.0,-1,0.38,N
3,spring,30,1,1,0,0,0.8,-1,0.50,O
4,spring,30,1,0,1,0,0.8,0,0.50,N

In [22]:
round(fertilidad.age.mean())

30

In [23]:
fertilidad.season.mode()

0    spring
Name: season, dtype: object

In [24]:
fertilidad.season.value_counts()

spring    36
fall      31
winter    28
summer     4
Name: season, dtype: int64

In [25]:
# Comprobación de valores nulos
fertilidad.isnull().values.any()

False

In [26]:
fertilidad.child_desea.replace({0:"yes",1:"no"},inplace = True)
fertilidad.head()

,season,age,child_desea,accident,surg_int,fever_l_year,f_alc_cons,smoke,h_sit,diagnosis
0,spring,35,no,0,1,0,0.8,1,0.31,O
1,spring,27,no,0,0,0,1.0,-1,0.50,N
2,spring,32,yes,1,1,0,1.0,-1,0.38,N
3,spring,30,no,1,0,0,0.8,-1,0.50,O
4,spring,30,no,0,1,0,0.8,0,0.50,N

In [27]:
# Number of hours spent sitting per day ene-16 (0, 1)
def sitting(value):
    max_hour = 24
    min_hour = 0
    hour = min_hour + (value * (max_hour - min_hour))
    return hour

fertilidad.h_sit = fertilidad.h_sit.apply(lambda x: sitting(x))
fertilidad.head()

,season,age,child_desea,accident,surg_int,fever_l_year,f_alc_cons,smoke,h_sit,diagnosis
0,spring,35,no,0,1,0,0.8,1,7.44,O
1,spring,27,no,0,0,0,1.0,-1,12.00,N
2,spring,32,yes,1,1,0,1.0,-1,9.12,N
3,spring,30,no,1,0,0,0.8,-1,12.00,O
4,spring,30,no,0,1,0,0.8,0,12.00,N

Frequency of alcohol consumption 1) several times a day, 2) every day, 3) several times a week, 4) once a week, 5) hardly ever or never (0, 1)

In [28]:
fertilidad.f_alc_cons.value_counts()

1.0    40
0.8    38
0.6    19
0.2     1
0.4     1
Name: f_alc_cons, dtype: int64

In [29]:
fertilidad.f_alc_cons.replace({1.0:"several times a day",0.8:"every day",0.6:"several times a week",0.4: "once a week",0.2:"hardly ever or never"},inplace = True)

In [30]:
fertilidad.head()

,season,age,child_desea,accident,surg_int,fever_l_year,f_alc_cons,smoke,h_sit,diagnosis
0,spring,35,no,0,1,0,every day,1,7.44,O
1,spring,27,no,0,0,0,several times a day,-1,12.00,N
2,spring,32,yes,1,1,0,several times a day,-1,9.12,N
3,spring,30,no,1,0,0,every day,-1,12.00,O
4,spring,30,no,0,1,0,every day,0,12.00,N

In [31]:
fertilidad.describe().T

              count       mean       std    min   25%    50%   75%   max
age            99.0  30.111111  2.258268  27.00  28.0  30.00  32.0  36.0
accident       99.0   0.434343  0.498193   0.00   0.0   0.00   1.0   1.0
surg_int       99.0   0.505051  0.502519   0.00   0.0   1.00   1.0   1.0
fever_l_year   99.0   0.191919  0.583389  -1.00   0.0   0.00   1.0   1.0
smoke          99.0  -0.353535  0.812066  -1.00  -1.0  -1.00   0.0   1.0
h_sit          99.0   9.648485  4.345906   1.44   6.0   9.12  12.0  24.0